'use server';

import { getTranslations } from 'next-intl/server';
import { company_mail } from '@/utils/constants';

export default async function PolicyPersian() {
  const t = await getTranslations();

  return (
    <>
      <p className="mb-2">تاریخ آخرین به‌روزرسانی: 1 اردیبهشت 1404</p>
      <div>
        <b>۱. ما که هستیم</b>
        {t('company_name')} ({t('app_company_name')}) (از این پس "شرکت"، "ما"،
        یا "اپلیکیشن") یک دستیار هوشمند بارداری مبتنی بر هوش مصنوعی است. این
        سیاست حفظ حریم خصوصی، نحوه جمع‌آوری، استفاده، افشاء و محافظت از اطلاعات
        کاربران در هنگام استفاده از خدمات ما (از جمله اپلیکیشن موبایل و وب‌سایت)
        را شرح می‌دهد.
      </div>

      <div>
        <b>۲. اطلاعاتی که جمع‌آوری می‌کنیم</b> ما اطلاعات مختلفی را برای ارائه و
        بهبود خدمات خود جمع‌آوری می‌کنیم:
        <ul>
          <li>
            <b>اطلاعات شخصی:</b> شامل نام، ایمیل و سایر اطلاعاتی که کاربر هنگام
            ثبت‌نام وارد می‌کند.
          </li>
          <li>
            <b>اطلاعات مرتبط با سلامت:</b> اطلاعات و سؤالات مرتبط با بارداری که
            توسط کاربران در اپلیکیشن وارد می‌شود.
          </li>
          <li>
            <b>اطلاعات دستگاه:</b> شامل نوع مرورگر، آدرس IP، سیستم عامل و
            کوکی‌ها.
          </li>
          <li>
            <b>داده‌های کاربری:</b> شامل نحوه استفاده از خدمات، ویژگی‌های
            استفاده‌شده و مدت زمان جلسات.
          </li>
        </ul>
      </div>

      <div>
        <b>۳. نحوه استفاده از اطلاعات</b> اطلاعات جمع‌آوری‌شده برای اهداف زیر
        استفاده می‌شود
        <ul>
          <li>ارائه، شخصی‌سازی و بهبود خدمات</li>
          <li>تحلیل رفتار کاربر جهت ارتقاء توصیه‌های مبتنی بر هوش مصنوعی</li>
          <li>حفظ امنیت و جلوگیری از فعالیت‌های مخرب یا متقلبانه</li>
          <li>رعایت الزامات قانونی</li>
        </ul>
      </div>

      <div>
        <b>۴. اشتراک‌گذاری اطلاعات</b> ما اطلاعات شخصی کاربران را به غیر نفروخته
        و تعهد می‌دهیم که این اطلاعات تنها نزد توسعه‌دهندگان برنامه محفوظ است و
        توسط شخص یا سازمانی مورد سوء استفاده قرار نخواهد گرفت.
      </div>
      <div>
        <b>۵. امنیت داده</b> ما اقدامات منطقی برای محافظت از اطلاعات کاربران
        انجام می‌دهیم، اما امنیت کامل در فضای دیجیتال قابل تضمین نیست. کاربران
        مسئول امنیت دستگاه و انتقال داده‌های خود هستند.
      </div>
      <div>
        <b>۶. حقوق کاربران</b> مطابق قوانین جاری، کاربران ممکن است از حقوق زیر
        برخوردار باشند:
        <ul>
          <li>دسترسی، ویرایش یا حذف اطلاعات شخصی</li>
          <li>مخالفت با پردازش داده‌ها</li>
          <li>پس گرفتن رضایت برای استفاده از داده‌ها</li>
        </ul>
        برای طرح هرگونه پرسش یا درخواست مرتبط با داده‌ها، لطفاً با ایمیل{' '}
        {company_mail} تماس بگیرید.
      </div>
      <div>
        <b>۷. تغییرات در سیاست حفظ حریم خصوصی</b> ممکن است این سیاست به‌روزرسانی
        شود. ادامه استفاده از خدمات پس از اعمال تغییرات، به منزله پذیرش نسخه
        جدید تلقی خواهد شد.
      </div>
    </>
  );
}
